/****************************************************************************************************
//
//		HLCollision.h
//
//		@brief	KoudoLib コリジョン管理
//		@author	Yasushi Hirakawa
//		@date	2015/12/04
//
****************************************************************************************************/

#ifndef __HLCOLLISION_H__
#define __HLCOLLISION_H__


//---------------------------------------------------------------------------------------------
//	include
//---------------------------------------------------------------------------------------------
#include "HLCommon.h"

//---------------------------------------------------------------------------------------------
//	struct
//--------------------------------------------------------------------------------------------- 

// 球コリジョン
struct HLCollisionSphere
{
	BoundingSphere		sphere;		// 球情報
	ContainmentType		collision;	// コリジョン情報
};

// 箱コリジョン
struct HLCollisionBox
{
	BoundingOrientedBox box;		// 箱情報
	ContainmentType		collision;	// コリジョン情報
};


//---------------------------------------------------------------------------------------------
//	class
//---------------------------------------------------------------------------------------------
class HLCollision
{
public:
	HLCollision();
	~HLCollision();

	BOOL Init();				// 初期化
	VOID Destroy();				// 破棄
	VOID Update();				// 更新


private:
};


#endif //__HLAUDIO_H__
